jackkc7vlo/MCUs/EFM32PG22/hal/i2c_hal.c
/******************************************************************************
 * Copyright (C) 2026 by Jack Wilson
 *
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 *  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 *  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 *  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 *
 ************************(C) COPYRIGHT 2026 Jack Wilson **********************/
/**
 * @file i2c_hal.c
 * @brief Generic I2C interface implementation.
 * @details Outlines the portable I2C abstraction used to configure and
 * interact with I2C peripherals on any supported platform.
 *
 * @author  Jack Wilson
 * @date    February 12, 2026
 * @version 1.0.0
 *
 * @copyright Copyright (c) 2026 Jack Wilson
 * @license MIT License
 */

/********************************************************************************
 * Includes
 ********************************************************************************/

#include <assert.h>
#include <clock_hal.h>
#include <device_reg.h>
#include <efm32pg22c200f512im40.h>
#include <gpio_hal.h>
#include <hw_config.h>
#include <i2c_hal.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h> /*lint -e129*/

#if HW_CONFIG_I2C == 1u

/********************************************************************************
 * Defines
 ********************************************************************************/
#define I2C_TXBUFFER_SIZE 10u
#define I2C_RXBUFFER_SIZE 10u
#define I2C_FLAG_WRITE 0x0001u
#define I2C_FLAG_READ 0x0002u
#define I2C_FLAG_WRITE_READ 0x0004u
#define I2C_FLAG_WRITE_WRITE 0x0008u
/** Use 10 bit address. */
#define I2C_FLAG_10BIT_ADDR 0x0010U
#define I2C_IF_ERRORS (I2C_IF_BUSERR | I2C_IF_ARBLOST)
#define I2C_IEN_ERRORS (I2C_IEN_BUSERR | I2C_IEN_ARBLOST)
/********************************************************************************
 * Typedefs & Enums
 ********************************************************************************/

static const uint8_t i2cNSum[]       = {4u + 4u, 6u + 3u, 11u + 6u, 4u + 4u};
static bool          i2c_initialized = false;
/********************************************************************************
 * Defines
 ********************************************************************************/
typedef struct
{
    /**
     * @brief
     *   Address to use after (repeated) start.
     * @details
     *   Layout details, A = Address bit, X = don't care bit (set to 0):
     *   @li 7 bit address - Use format AAAA AAAX
     *   @li 10 bit address - Use format XXXX XAAX AAAA AAAA
     */
    uint16_t addr;

    /** Flags defining sequence type and details, see I2C_FLAG_ defines. */
    uint16_t flags;

    /**
     * Buffers used to hold data to send from or receive into, depending
     * on sequence type.
     */
    struct
    {
        /** Buffer used for data to transmit/receive, must be @p len long. */
        uint8_t *data;

        /**
         * Number of bytes in @p data to send or receive. Notice that when
         * receiving data to this buffer, at least 1 byte must be received.
         * Setting @p len to 0 in the receive case is considered a usage fault.
         * Transmitting 0 bytes is legal, in which case only the address
         * is transmitted after the start condition.
         */
        uint16_t len;
    } buf[2];
} I2C_TransferSeq_TypeDef;

typedef enum
{
    /* In progress code (>0) */
    i2cTransferInProgress = 1, /**< Transfer in progress. */

    /* Complete code (=0) */
    i2cTransferDone = 0, /**< Transfer completed successfully. */

    /* Transfer error codes (<0). */
    i2cTransferNack       = -1, /**< NACK received during transfer. */
    i2cTransferBusErr     = -2, /**< Bus error during transfer (misplaced START/STOP). */
    i2cTransferArbLost    = -3, /**< Arbitration lost during transfer. */
    i2cTransferUsageFault = -4, /**< Usage fault. */
    i2cTransferSwFault    = -5  /**< SW fault. */
} I2C_TransferReturn_TypeDef;

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/** Master mode transfer states. */
typedef enum
{
    i2cStateStartAddrSend,    /**< Send start + (first part of) address. */
    i2cStateAddrWFAckNack,    /**< Wait for ACK/NACK on (the first part of) address. */
    i2cStateAddrWF2ndAckNack, /**< Wait for ACK/NACK on the second part of a 10 bit address. */
    i2cStateRStartAddrSend,   /**< Send a repeated start + (first part of) address. */
    i2cStateRAddrWFAckNack,   /**< Wait for ACK/NACK on an address sent after a repeated start. */
    i2cStateDataSend,         /**< Send data. */
    i2cStateDataWFAckNack,    /**< Wait for ACK/NACK on data sent. */
    i2cStateWFData,           /**< Wait for data. */
    i2cStateWFStopSent,       /**< Wait for STOP to have been transmitted. */
    i2cStateDone              /**< Transfer completed successfully. */
} I2C_TransferState_TypeDef;

typedef struct
{
    /** Current state. */
    I2C_TransferState_TypeDef state;

    /** Result return code. */
    I2C_TransferReturn_TypeDef result;

    /** Offset in the current sequence buffer. */
    uint16_t offset;

    /* Index to the current sequence buffer in use. */
    uint8_t bufIndx;

    /** Reference to the I2C transfer sequence definition provided by the user. */
    I2C_TransferSeq_TypeDef *seq;

    /** Timeout counter for polled mode */
    uint32_t timeout;
} I2C_Transfer_TypeDef;

// support for I2C callbacks
typedef struct i2c_callback_context_s
{                                       /**< The GPIO pin number */
    p_i2c_callback_t callback;          /**< Registered interrupt callback */
    void            *p_callback_handle; /**< Pointer to callback context (i.e. Button handle)*/
    void            *callback_context;  /**< User callback context */
} i2c_callback_context_t;

/********************************************************************************
 * Private I2C HAL struct (definition kept in the implementation file).
 ********************************************************************************/
struct i2c_hal
{
    uint32_t                       in_use_count; /*!< Indicates if this I2C instance is in use */
    uint32_t                       device_id;    /*!< bus id */
    bool                           address_is_7_bit; /*!< 7 bit address */
    p_gpio_hal_t                   p_scl_gpio;
    p_gpio_hal_t                   p_sda_gpio; /*lint !e551*/
    I2C_TypeDef                   *i2c_port;   /*!< I2C peripheral */
    volatile I2C_Transfer_TypeDef *transfer;   /*!< I2C transfer state information */
    i2c_callback_context_t         callback;   /**< Registered interrupt callbacks */
};

