jackkc7vlo/MCUs/EFM32PG22/hal/i2c_hal.c
I2C_TransferReturn_TypeDef I2C_TransferInit(p_i2c_hal_t p_handle, I2C_TransferSeq_TypeDef *seq);
I2C_TransferReturn_TypeDef I2C_Transfer(p_i2c_hal_t p_handle);

typedef enum
{
    i2cClockHLRStandard  = _I2C_CTRL_CLHR_STANDARD,   /**< Ratio is 4:4 */
    i2cClockHLRAsymetric = _I2C_CTRL_CLHR_ASYMMETRIC, /**< Ratio is 6:3 */
    i2cClockHLRFast      = _I2C_CTRL_CLHR_FAST        /**< Ratio is 11:3 */
} I2C_ClockHLR_TypeDef;

typedef struct
{
    I2C_TypeDef         *port;       /**< Peripheral port */
    uint32_t             sclPort;    /**< SCL pin port number */
    uint8_t              sclPin;     /**< SCL pin number */
    uint32_t             sdaPort;    /**< SDA pin port number */
    uint8_t              sdaPin;     /**< SDA pin number */
    uint32_t             i2cRefFreq; /**< I2C reference clock */
    uint32_t             i2cMaxFreq; /**< I2C max bus frequency to use */
    I2C_ClockHLR_TypeDef i2cClhr;    /**< Clock low/high ratio control */
} I2CSPM_Init_TypeDef;

const I2CSPM_Init_TypeDef init_sensor = {.port       = I2C1,
                                         .sclPort    = GPIO_PORTD,
                                         .sclPin     = 3u,
                                         .sdaPort    = GPIO_PORTD,
                                         .sdaPin     = 2u,
                                         .i2cRefFreq = 0u,
                                         .i2cMaxFreq = 100000u,
                                         .i2cClhr    = i2cClockHLRStandard};

static i2c_hal_t            i2c_hal_devices[NUM_I2C_DEVICES] = {0};
static I2C_Transfer_TypeDef i2c_transfers[NUM_I2C_DEVICES]   = {0};

void i2c_hal_bus_freq_set(I2C_TypeDef *const i2c, uint32_t freqRef, const uint32_t freqScl,
                          uint32_t i2cMode)
{
    uint32_t n;
    uint32_t minFreq;
    uint32_t denominator;
    int32_t  divideby;

    /* Avoid dividing by 0. */
    // assert(freqScl != 0u);
    if (freqScl == 0u)
    {
        return;
    }

    /* Ensure mode is valid */
    i2cMode &= _I2C_CTRL_CLHR_MASK >> _I2C_CTRL_CLHR_SHIFT;

    /* Set the CLHR (clock low-to-high ratio). */
    i2c->CTRL &= ~_I2C_CTRL_CLHR_MASK;
    device_reg_masked_write(&i2c->CTRL, _I2C_CTRL_CLHR_MASK, i2cMode << _I2C_CTRL_CLHR_SHIFT);

    /*
             case cmuClock_PCLK:
          ret = (CMU->SYSCLKCTRL & _CMU_SYSCLKCTRL_PCLKPRESC_MASK)
                >> _CMU_SYSCLKCTRL_PCLKPRESC_SHIFT;
    */

    if (freqRef == 0u)
    {
        const uint32_t clock_div = ((CMU->SYSCLKCTRL & _CMU_SYSCLKCTRL_PCLKPRESC_MASK) >>
                                    _CMU_SYSCLKCTRL_PCLKPRESC_SHIFT) +
                                   1u;
        if (i2c == I2C0)
        {
            // freqRef = CMU_ClockFreqGet(cmuClock_I2C0);
            freqRef = SystemHCLKGet() / (clock_div / 2U);
#if defined(I2C1)
        }
        else if (i2c == I2C1)
        {
            freqRef = SystemHCLKGet() / clock_div;
            // freqRef = CMU_ClockFreqGet(cmuClock_I2C1);
#endif
        }
        else
        {
            assert((bool)false); /*lint !e506*/
        }
    }

    /* Check the minumum HF peripheral clock. */
    minFreq = 14000000u; /*lint !e9117*/
    if (i2c->CTRL & I2C_CTRL_SLAVE)
    {
        switch (i2cMode)
        {
        case i2cClockHLRStandard:
            minFreq = 2000000u;
            break;
        case i2cClockHLRAsymetric:
            minFreq = 5000000u;
            break;
        case i2cClockHLRFast:
            minFreq = 14000000u;
            break;
        default:
            /* MISRA requires the default case. */
            break;
        }
    }
    else
    {
        /* For master mode, platform 1 and 2 share the same
           minimum frequencies. */
        switch (i2cMode)
        {
        case i2cClockHLRStandard:
            minFreq = 2000000u;
            break;
        case i2cClockHLRAsymetric:
            minFreq = 9000000u;
            break;
        case i2cClockHLRFast:
            minFreq = 20000000u;
            break;
        default:
            /* MISRA requires default case */
            break;
        }
    }

    /* Frequency must be larger-than. */
    assert(freqRef > minFreq);

    /* SCL frequency is given by:
     * freqScl = freqRef/((Nlow + Nhigh) * (DIV + 1) + I2C_CR_MAX)
     *
     * Therefore,
     * DIV = ((freqRef - (I2C_CR_MAX * freqScl))/((Nlow + Nhigh) * freqScl)) - 1
     *
     * For more details, see the reference manual
     * I2C Clock Generation chapter.  */

    /* n = Nlow + Nhigh */
    n           = (uint32_t)i2cNSum[i2cMode];
    denominator = n * freqScl;

    /* Explicitly ensure denominator is never zero. */
    if (denominator == 0u)
    {
        // assert(0);
        return;
    }
    /* Perform integer division so that div is rounded up. */
    divideby = ((freqRef - (8 * freqScl) + denominator - 1) / denominator) -
               1; /*lint !e9117 !e834 !e713 */
    assert(divideby >= 0);
    assert((uint32_t)divideby <= _I2C_CLKDIV_DIV_MASK);

    /* The clock divisor must be at least 1 in slave mode according to the reference */
    /* manual (in which case there is normally no need to set the bus frequency). */
    if ((i2c->CTRL & I2C_CTRL_SLAVE) && (divideby == 0))
    {
        divideby = 1;
    }
    i2c->CLKDIV = (uint32_t)divideby;
}
/********************************************************************************
 * @brief          Initialization function for the I2C driver
 * @retval         None
 ********************************************************************************/
void i2c_hal_initialize(void)
{
    if (!i2c_initialized)
    {
        // perform any necessary hardware initialization here
        i2c_initialized = true;
    }
}

/********************************************************************************
 * @brief          Check if the I2C driver is initialized
 * @retval         true if initialized, false otherwise
 ********************************************************************************/
bool i2c_hal_is_initialized(void)
{
    return i2c_initialized;
}

