jackkc7vlo/MCUs/EFM32PG22/hal/i2c_hal.c
        /* Disable the I2C peripheral clock */
        uint32_t i2cClock;
        if (p_handle->device_id == 0u)
        {
            i2cClock = (1u << 5u) | (14u << 0u); /*lint !e835*/
        }
        else if (p_handle->device_id == 1u)
        {
            i2cClock = (1u << 5u) | (15u << 0u); /*lint !e835*/
        }
        else
        {
            i2cClock = 0u; /* unknown, skip clock disable */
        }

        if (i2cClock != 0u)
        {
            clock_hal_enable(i2cClock, (bool)false);
        }

        /* Clear the transfer state */
        p_handle->transfer->state  = i2cStateDone;
        p_handle->transfer->result = i2cTransferDone;
        p_handle->transfer->offset = 0u;
        p_handle->transfer->seq    = NULL;

        /* Clear the callback */
        p_handle->callback.callback          = NULL;
        p_handle->callback.p_callback_handle = NULL;
        p_handle->callback.callback_context  = NULL;

        gpio_hal_remove(p_handle->p_scl_gpio);
        gpio_hal_remove(p_handle->p_sda_gpio);

        p_handle->p_scl_gpio = NULL;
        p_handle->p_sda_gpio = NULL;

        /* Clear the device fields */
        p_handle->i2c_port = NULL;
        p_handle->transfer = NULL;
    }

    // p_handle->in_use = false;
}

/********************************************************************************
 * @brief          Write function for the I2C driver
 * @param[in]      p_handle - pointer to the i2c device
 * @param[in]      cmd_or_register - The register or command to write data to
 *(i.e. memory address)
 * @param[in]      cmd_or_register_len - Length of the I2 register or command in
 *bytes
 * @param[in]      data -  pointer to data to send (may be words depending on
 *MCU)
 * @param[in]      data_len - Length of data to write in bytes
 * @retval         Number of bytes written
 ********************************************************************************/
uint32_t i2c_hal_write(const p_i2c_hal_t p_handle, const uint32_t slave_address,
                       const uint32_t cmd_or_register, const uint32_t cmd_or_register_len,
                       const uint8_t *const data, const uint_fast16_t data_len)
{
    // char          error          = 0;
    // uint_fast16_t bytes_written  = 0;
    // uint_fast16_t bytes_to_write = data_len;
    // uint8_t      *pdata          = (uint8_t *)data;

    I2C_TransferSeq_TypeDef    i2cTransferData;
    I2C_TransferReturn_TypeDef result;
    const uint8_t chipdata[2] = {(uint8_t)(cmd_or_register >> 8), (uint8_t)cmd_or_register};

    // Initialize I2C transfer
    i2cTransferData.addr  = (uint16_t)slave_address;
    i2cTransferData.flags = I2C_FLAG_WRITE;
    if (cmd_or_register_len > 0u)
    {
        i2cTransferData.flags       = I2C_FLAG_WRITE_WRITE;
        i2cTransferData.buf[0].data = (uint8_t *)(chipdata + (cmd_or_register_len & 1u));
        i2cTransferData.buf[0].len  = (uint16_t)cmd_or_register_len;

        i2cTransferData.buf[1].data = (uint8_t *)data;
        i2cTransferData.buf[1].len  = (uint16_t)data_len;
    }
    else
    {
        i2cTransferData.buf[0].data = (uint8_t *)data;
        i2cTransferData.buf[0].len  = (uint16_t)data_len;
    }

    result = I2C_TransferInit(p_handle, &i2cTransferData);

    // Send data
    while (result == i2cTransferInProgress)
    {
        result = I2C_Transfer(p_handle);
    }

    if (result != i2cTransferDone)
    {
        return 0u;
    }

    return data_len;
    /* wait until bus is not busy */
}

/********************************************************************************
 * @brief          Read function for the I2C driver
 * @param[in]      p_handle - pointer to the i2c device
 * @param[in]      cmd_or_register - The register or command to write data to
 *(i.e. memory address)
 * @param[in]      cmd_or_register_len - Length of the register or command in
 *bytes
 * @param[in]      data -  pointer to data (in bytes!) to read
 * @param[in]      data_len - Length of data to read in bytes
 * @retval         Number of bytes read
 ********************************************************************************/
uint32_t i2c_hal_read(const p_i2c_hal_t p_handle, const uint32_t slave_address,
                      const uint32_t cmd_or_register, const uint32_t cmd_or_register_len,
                      uint8_t *const data, const uint_fast16_t data_len)
{
    // char          error;
    // uint_fast16_t bytes_to_read = data_len;
    // uint8_t      *pdata         = data;

    // Transfer structure
    I2C_TransferSeq_TypeDef    i2cTransferData;
    I2C_TransferReturn_TypeDef result;
    uint8_t chipdata[2] = {(uint8_t)(cmd_or_register >> 8), (uint8_t)cmd_or_register};
    // Initialize I2C transfer
    i2cTransferData.addr  = (uint16_t)slave_address;
    i2cTransferData.flags = I2C_FLAG_WRITE_READ; // must write target address before reading
    if (cmd_or_register_len > 0u)
    {
        i2cTransferData.buf[0].data = (uint8_t *)(chipdata + (cmd_or_register_len & 1u));
        i2cTransferData.buf[0].len  = (uint16_t)cmd_or_register_len;

        i2cTransferData.buf[1].data = (uint8_t *)data;
        i2cTransferData.buf[1].len  = (uint16_t)data_len;
    }
    else
    {
        i2cTransferData.flags       = I2C_FLAG_READ;
        i2cTransferData.buf[0].data = (uint8_t *)data;
        i2cTransferData.buf[0].len  = (uint16_t)data_len;
    }

    result = I2C_TransferInit(p_handle, &i2cTransferData);

    // Send data
    while (result == i2cTransferInProgress)
    {
        result = I2C_Transfer(p_handle);
    }

    if (result != i2cTransferDone)
    {
        return 0u;
    }
    return data_len;

    if (data_len <= 0)
        return -1; /* no read was performed */

    return 0; /* no error */
}

/********************************************************************************
 * @brief  Enable (power on) or disable (power off) to the i2c devices
 * @param[in]      p_handle - pointer to the i2c device
 * @param[in]      turn_on - enable or disable the i2c devices (POWER_ON or
 *POWER_OFF)
 * @param[in]      settle_time_ms - number of milliseconds to wait for the i2c
 *                                  devices power on
 * @retval
 ********************************************************************************/
void i2c_hal_enable(const p_i2c_hal_t p_handle, const bool turn_on, const uint32_t settle_time_ms)
{
    if (p_handle == NULL)
    {
        return;
    }

    /* Determine the peripheral clock identifier from the bus id.
     * Board id 0 -> I2C0 clock: (1u << 5u) | 14u
     * Board id 1 -> I2C1 clock: (1u << 5u) | 15u */
    uint32_t i2cClock;
    if (p_handle->device_id == 0u)
    {
        i2cClock = (1u << 5u) | (14u << 0u); /*lint !e835*/
    }
    else if (p_handle->device_id == 1u)
    {
        i2cClock = (1u << 5u) | (15u << 0u); /*lint !e835*/
    }
    else
    {
        return; /* unsupported bus id */
    }

    if (turn_on)
    {
        /* Enable the peripheral clock */
        clock_hal_enable(i2cClock, (bool)true);

        /* Enable the I2C peripheral */
        device_reg_bit_write(&(p_handle->i2c_port->EN), _I2C_EN_EN_SHIFT, true); /*lint !e9117*/

        /* Allow the bus to settle after power-on */
        if (settle_time_ms > 0u)
        {
            clock_hal_delay(settle_time_ms);
        }
    }
    else
    {
        /* Send ABORT+STOP in case a transfer is still in progress */
        p_handle->i2c_port->CMD = I2C_CMD_ABORT | I2C_CMD_STOP;

        /* Disable the I2C peripheral */
        device_reg_bit_write(&(p_handle->i2c_port->EN), _I2C_EN_EN_SHIFT, false); /*lint !e9117*/

        /* Disable the peripheral clock to save power */
        clock_hal_enable(i2cClock, (bool)false);
    }
}

/**
 * @brief Register a callback to be invoked on GPIO interrupt events.
 * @param[in] handle Pointer to platform-specific context associated with the
 * callback.
 * @param callback Function to invoke when an interrupt fires. May be NULL to
 * clear the registration.
 *
 * @return 0 on success, negative value when registration fails.
 */
int i2c_hal_register_callback(const p_i2c_hal_t p_handle, p_i2c_callback_t callback,
                              void *p_callback_context)
{
    if (p_handle == NULL)
    {
        return -1; // Invalid handle
    }

    p_handle->callback.callback          = callback;
    p_handle->callback.p_callback_handle = p_callback_context;

    return 0; // Success
}

