jackkc7vlo/MCUs/EFM32PG22/hal/i2c_hal.c
#if USE_I2C_INTERRUPTS == 1
/**
 * @brief  Handle an I2C interrupt
 * @retval None
 */
void i2c_hal_irqhandler(void);
#endif

uint32_t i2c_hal_scan(const uint32_t i2c_board_id, const uint32_t sda_port, const uint32_t sda_pin,
                      const uint32_t scl_port, const uint32_t scl_pin, uint32_t last_found_address)
{
    p_i2c_hal_t p_handle =
        i2c_hal_create_device(i2c_board_id, sda_port, sda_pin, scl_port, scl_pin, NULL);
    if (p_handle == NULL)
    {
        return 0; // Failed to create I2C device
    }

    i2c_hal_enable(p_handle, true, 10U);

    uint8_t  chipdata[2];
    uint32_t cmd_data      = 0u;
    uint32_t start_address = (last_found_address < 0x08U) ? 0x08U : (last_found_address + 1u);
    for (uint32_t i = start_address; i <= 0x77U; i++)
    {
        if (i2c_hal_read(p_handle, i << 1, cmd_data, 1u, chipdata, 1u) > 0u)
        {
            i2c_hal_remove_device(p_handle);
            return i; // Found a device at this address
        }
        clock_hal_delay(1U); // Small delay between scans
    }
    return 0;
}

static void flushRx(I2C_TypeDef *const i2c)
{
    uint32_t timeout = 10000u; // Timeout to prevent infinite loop
    while ((i2c->STATUS & I2C_STATUS_RXDATAV) && (--timeout > 0u))
    {
        i2c->RXDATA;
    }

    /* SW needs to clear RXDATAV IF on Series 2 devices.
       Flag is kept high by HW if buffer is not empty. */
    // I2C_IntClear(i2c, I2C_IF_RXDATAV);
    i2c->IF_CLR = I2C_IF_RXDATAV;
}

/** @endcond */

I2C_TransferReturn_TypeDef I2C_Transfer(p_i2c_hal_t p_handle)
{
    uint32_t tmp;
    uint32_t pending;
    // static volatile I2C_Transfer_TypeDef *transfer; /*lint !e956*/
    const I2C_TransferSeq_TypeDef *seq;
    bool                           finished = false;

    // assert(I2C_REF_VALID(i2c));

    // transfer         = p_handle->transfer;
    I2C_TypeDef *i2c = p_handle->i2c_port;

    seq = p_handle->transfer->seq;
    while (!finished)
    {
        pending = i2c->IF;

        /* Check timeout to prevent infinite loop */
        if (p_handle->transfer->timeout == 0u)
        {
            p_handle->transfer->result = i2cTransferNack;
            p_handle->transfer->state  = i2cStateDone;
            i2c->CMD                   = I2C_CMD_STOP | I2C_CMD_ABORT;
            break;
        }
        p_handle->transfer->timeout--;

        /* If some sort of fault, abort transfer. */
        if (pending & I2C_IF_ERRORS)
        {
            if (pending & I2C_IF_ARBLOST)
            {
                /* If an arbitration fault, indicates either a slave device */
                /* not responding as expected, or other master which is not */
                /* supported by this software. */
                p_handle->transfer->result = i2cTransferArbLost;
            }
            else if (pending & I2C_IF_BUSERR)
            {
                /* A bus error indicates a misplaced start or stop, which should */
                /* not occur in master mode controlled by this software. */
                p_handle->transfer->result = i2cTransferBusErr;
            }

            /* Ifan error occurs, it is difficult to know */
            /* an exact cause and how to resolve. It will be up to a wrapper */
            /* to determine how to handle a fault/recovery if possible. */
            p_handle->transfer->state = i2cStateDone;
            break;
        }

        switch (p_handle->transfer->state)
        {
        /***************************************************/
        /* Send the first start+address (first byte if 10 bit). */
        /***************************************************/
        case i2cStateStartAddrSend:
            if (seq->flags & I2C_FLAG_10BIT_ADDR)
            {
                tmp = (((uint32_t)(seq->addr) >> 8u) & 0x06u) | 0xf0u;

                /* In 10 bit address mode, the address following the first */
                /* start always indicates write. */
            }
            else
            {
                tmp = (uint32_t)(seq->addr) & 0xfeu;

                if (seq->flags & I2C_FLAG_READ)
                {
                    /* Indicate read request */
                    tmp |= 1u;
                }
            }

            p_handle->transfer->state = i2cStateAddrWFAckNack;
            i2c->TXDATA               = tmp; /* Data not transmitted until the START is sent. */
            i2c->CMD                  = I2C_CMD_START; /*lint !e835*/
            break;

        /*******************************************************/
        /* Wait for ACK/NACK on the address (first byte if 10 bit). */
        /*******************************************************/
        case i2cStateAddrWFAckNack:
            if (pending & I2C_IF_NACK)
            {
                // I2C_IntClear(i2c, I2C_IF_NACK);
                i2c->IF_CLR                = I2C_IF_NACK;
                p_handle->transfer->result = i2cTransferNack;
                p_handle->transfer->state  = i2cStateWFStopSent;
                i2c->CMD                   = I2C_CMD_STOP;
                finished                   = true;
            }
            else if (pending & I2C_IF_ACK)
            {
                // I2C_IntClear(i2c, I2C_IF_ACK);
                i2c->IF_CLR = I2C_IF_ACK;

                /* If a 10 bit address, send the 2nd byte of the address. */
                if (seq->flags & I2C_FLAG_10BIT_ADDR)
                {
                    p_handle->transfer->state = i2cStateAddrWF2ndAckNack;
                    i2c->TXDATA               = (uint32_t)(seq->addr) & 0xffu;
                }
                else
                {
                    /* Determine whether receiving or sending data. */
                    if (seq->flags & I2C_FLAG_READ)
                    {
                        p_handle->transfer->state = i2cStateWFData;
                        if (seq->buf[p_handle->transfer->bufIndx].len == 1u)
                        {
                            i2c->CMD = I2C_CMD_NACK;
                        }
                    }
                    else
                    {
                        p_handle->transfer->state = i2cStateDataSend;
                        continue;
                    }
                }
                finished = true;
            }
            break;

        /******************************************************/
        /* Wait for ACK/NACK on the second byte of a 10 bit address. */
        /******************************************************/
        case i2cStateAddrWF2ndAckNack:
            if (pending & I2C_IF_NACK)
            {
                // I2C_IntClear(i2c, I2C_IF_NACK);
                i2c->IF_CLR                = I2C_IF_NACK;
                p_handle->transfer->result = i2cTransferNack;
                p_handle->transfer->state  = i2cStateWFStopSent;
                i2c->CMD                   = I2C_CMD_STOP;
                finished                   = true;
            }
            else if (pending & I2C_IF_ACK)
            {
                // I2C_IntClear(i2c, I2C_IF_ACK);
                i2c->IF_CLR = I2C_IF_ACK;

