jackkc7vlo/MCUs/EFM32PG22/hal/i2c_hal.c
                /* If using a plain read sequence with a 10 bit address, switch to send */
                /* a repeated start. */
                if (seq->flags & I2C_FLAG_READ)
                {
                    p_handle->transfer->state = i2cStateRStartAddrSend;
                }
                /* Otherwise, expected to write 0 or more bytes. */
                else
                {
                    p_handle->transfer->state = i2cStateDataSend;
                }
                continue;
            }
            break;

        /*******************************/
        /* Send a repeated start+address */
        /*******************************/
        case i2cStateRStartAddrSend:
            if (seq->flags & I2C_FLAG_10BIT_ADDR)
            {
                tmp = (uint32_t)((seq->addr >> 8) & 0x06u) | 0xf0u;
            }
            else
            {
                tmp = (uint32_t)(seq->addr & 0xfeu);
            }

            /* If this is a write+read combined sequence, read is about to start. */
            if (seq->flags & I2C_FLAG_WRITE_READ)
            {
                /* Indicate a read request. */
                tmp |= 1u;
                /* If reading only one byte, prepare the NACK now before START command. */
                if (seq->buf[p_handle->transfer->bufIndx].len == 1u)
                {
                    i2c->CMD = I2C_CMD_NACK;
                }
            }

            p_handle->transfer->state = i2cStateRAddrWFAckNack;
            /* The START command has to be written first since repeated start. Otherwise, */
            /* data would be sent first. */
            i2c->CMD    = I2C_CMD_START; /*lint !e835*/
            i2c->TXDATA = tmp;

            break;

        /**********************************************************************/
        /* Wait for ACK/NACK on the repeated start+address (first byte if 10 bit) */
        /**********************************************************************/
        case i2cStateRAddrWFAckNack:
            if (pending & I2C_IF_NACK)
            {
                // I2C_IntClear(i2c, I2C_IF_NACK);
                i2c->IF_CLR                = I2C_IF_NACK;
                p_handle->transfer->result = i2cTransferNack;
                p_handle->transfer->state  = i2cStateWFStopSent;
                i2c->CMD                   = I2C_CMD_STOP;
                finished                   = true;
            }
            else if (pending & I2C_IF_ACK)
            {
                // I2C_IntClear(i2c, I2C_IF_ACK);
                i2c->IF_CLR = I2C_IF_ACK;

                /* Determine whether receiving or sending data. */
                if (seq->flags & I2C_FLAG_WRITE_READ)
                {
                    p_handle->transfer->state = i2cStateWFData;
                }
                else
                {
                    p_handle->transfer->state = i2cStateDataSend;
                    continue;
                }
                finished = true;
            }
            break;

        /*****************************/
        /* Send a data byte to the slave */
        /*****************************/
        case i2cStateDataSend:
            /* Reached end of data buffer. */
            if (p_handle->transfer->offset >= seq->buf[p_handle->transfer->bufIndx].len)
            {
                /* Move to the next message part. */
                p_handle->transfer->offset = 0u;
                p_handle->transfer->bufIndx++;

                /* Send a repeated start when switching to read mode on the 2nd buffer. */
                if (seq->flags & I2C_FLAG_WRITE_READ)
                {
                    p_handle->transfer->state = i2cStateRStartAddrSend;
                    continue;
                }

                /* Only writing from one buffer or finished both buffers. */
                if ((seq->flags & I2C_FLAG_WRITE) || (p_handle->transfer->bufIndx > 1u))
                {
                    p_handle->transfer->state = i2cStateWFStopSent;
                    i2c->CMD                  = I2C_CMD_STOP;
                    finished                  = true;
                    break;
                }

                /* Reprocess in case the next buffer is empty. */
                continue;
            }

            /* Send byte. */
            i2c->TXDATA               = (uint32_t)(seq->buf[p_handle->transfer->bufIndx]
                                         .data[p_handle->transfer->offset++]);
            p_handle->transfer->state = i2cStateDataWFAckNack;
            break;

        /*********************************************************/
        /* Wait for ACK/NACK from the slave after sending data to it. */
        /*********************************************************/
        case i2cStateDataWFAckNack:
            if (pending & I2C_IF_NACK)
            {
                // I2C_IntClear(i2c, I2C_IF_NACK);
                i2c->IF_CLR                = I2C_IF_NACK;
                p_handle->transfer->result = i2cTransferNack;
                p_handle->transfer->state  = i2cStateWFStopSent;
                i2c->CMD                   = I2C_CMD_STOP;
                finished                   = true;
            }
            else if (pending & I2C_IF_ACK)
            {
                // I2C_IntClear(i2c, I2C_IF_ACK);
                i2c->IF_CLR               = I2C_IF_ACK;
                p_handle->transfer->state = i2cStateDataSend;
                continue;
            }
            break;

        /****************************/
        /* Wait for data from slave */
        /****************************/
        case i2cStateWFData:
            if (pending & I2C_IF_RXDATAV)
            {
                uint8_t        data;
                const uint32_t rxLen = seq->buf[p_handle->transfer->bufIndx].len;

                /* Must read out data not to block further progress. */
                data = (uint8_t)(i2c->RXDATA);

#if (defined(_SILICON_LABS_32B_SERIES_2_CONFIG_1) ||                                               \
     defined(_SILICON_LABS_32B_SERIES_2_CONFIG_2) || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_3))
                // Errata I2C_E303. I2C Fails to Indicate New Incoming Data.
                const uint32_t status = i2c->STATUS;
                // look for invalid RXDATAV = 0 and RXFULL = 1 condition
                if (((status & I2C_IF_RXDATAV) == 0u) &
                    ((status & I2C_IF_RXFULL) != 0u)) /*lint !e514 !e9130*/
                {
                    // Performing a dummy read of the RXFIFO (I2C_RXDATA).
                    // This restores the expected RXDATAV = 1 and RXFULL = 0 condition.
                    (void)i2c->RXDATA;
                    // The dummy read will also set the RXUFIF flag bit, which should be ignored and
                    // cleared. I2C_IntClear(i2c, I2C_IF_RXUF);
                    i2c->IF_CLR = I2C_IF_RXUF;
                }
#endif

