jackkc7vlo/MCUs/EFM32PG22/hal/i2c_hal.c
                /* SW needs to clear RXDATAV IF on Series 2 devices.
                   Flag is kept high by HW if buffer is not empty. */
                // 2C_IntClear(i2c, I2C_IF_RXDATAV);
                i2c->IF_CLR = I2C_IF_RXDATAV;

                /* Make sure that there is no storing beyond the end of the buffer (just in case).
                 */
                if (p_handle->transfer->offset < rxLen)
                {
                    seq->buf[p_handle->transfer->bufIndx].data[p_handle->transfer->offset++] = data;
                }

                /* If all requested data is read, the sequence should end. */
                if (p_handle->transfer->offset >= rxLen)
                {
                    p_handle->transfer->state = i2cStateWFStopSent;
                    i2c->CMD                  = I2C_CMD_STOP;
                }
                else
                {
                    /* Send ACK and wait for the next byte. */
                    i2c->CMD = I2C_CMD_ACK;

                    if ((1u < rxLen) && (p_handle->transfer->offset == (rxLen - 1u)))
                    {
                        /* If receiving more than one byte and this is the next
                           to last byte, transmit the NACK now before receiving
                           the last byte. */
                        i2c->CMD = I2C_CMD_NACK;
                    }
                }
                finished = true;
            }
            break;

        /***********************************/
        /* Wait for STOP to have been sent */
        /***********************************/
        case i2cStateWFStopSent:
            if (pending & I2C_IF_MSTOP)
            {
                // I2C_IntClear(i2c, I2C_IF_MSTOP);
                i2c->IF_CLR               = I2C_IF_MSTOP;
                p_handle->transfer->state = i2cStateDone;
                finished                  = true;
            }
            break;

        /******************************/
        /* An unexpected state, software fault */
        /******************************/
        default:
            p_handle->transfer->result = i2cTransferSwFault;
            p_handle->transfer->state  = i2cStateDone;
            finished                   = true;
            break;
        } /*lint !e788*/
    }

    if (p_handle->transfer->state == i2cStateDone)
    {
        /* Disable interrupt sources when done. */
        i2c->IEN = 0u;

        /* Update the result unless a fault has already occurred. */
        if (p_handle->transfer->result == i2cTransferInProgress)
        {
            p_handle->transfer->result = i2cTransferDone;
        }
    }
    /* Until transfer is done, keep returning i2cTransferInProgress. */
    else
    {
        return i2cTransferInProgress;
    }

    return p_handle->transfer->result;
} /*lint !e952*/

I2C_TransferReturn_TypeDef I2C_TransferInit(p_i2c_hal_t p_handle, I2C_TransferSeq_TypeDef *seq)
{
    // static volatile I2C_Transfer_TypeDef *transfer; /*lint !e956*/

    assert(seq);

    // transfer         = p_handle->transfer;
    I2C_TypeDef *i2c = p_handle->i2c_port;

    /* Check if in a busy state. Since this software assumes a single master, */
    /* issue an abort. The BUSY state is normal after a reset. */
    if (i2c->STATE & I2C_STATE_BUSY) /*lint !e835*/
    {
        i2c->CMD = I2C_CMD_ABORT;
        /* Wait for abort to complete */
        uint32_t abort_timeout = 1000u;
        while ((i2c->STATE & I2C_STATE_BUSY) && (--abort_timeout > 0u))
        {
            /* Wait */
        }
        if (abort_timeout == 0u)
        {
            return i2cTransferBusErr; /* Bus stuck */
        }
    }

    /* Do not try to read 0 bytes. It is not */
    /* possible according to the I2C spec, since the slave will always start */
    /* sending the first byte ACK on an address. The read operation can */
    /* only be stopped by NACKing a received byte, i.e., minimum 1 byte. */
    if (((seq->flags & I2C_FLAG_READ) && !(seq->buf[0].len)) ||
        ((seq->flags & I2C_FLAG_WRITE_READ) && !(seq->buf[1].len))) /*lint !e9130 !e9117*/
    {
        return i2cTransferUsageFault;
    }

    /* Prepare for a transfer. */
    p_handle->transfer->state   = i2cStateStartAddrSend;
    p_handle->transfer->result  = i2cTransferInProgress;
    p_handle->transfer->offset  = 0u;
    p_handle->transfer->bufIndx = 0u;
    p_handle->transfer->seq     = seq;
    p_handle->transfer->timeout = 100000u; /* Timeout for polled mode */

    /* Ensure buffers are empty. */
    i2c->CMD = I2C_CMD_CLEARPC | I2C_CMD_CLEARTX;
    flushRx(i2c);

    /* Clear all pending interrupts prior to starting a transfer. */
    // I2C_IntClear(i2c, _I2C_IF_MASK);
    i2c->IF_CLR = _I2C_IF_MASK;
    /* Enable relevant interrupts. */
    /* Notice that the I2C interrupt must also be enabled in the NVIC, but */
    /* that is left for an additional driver wrapper. */
    i2c->IEN |= I2C_IEN_NACK | I2C_IEN_ACK | I2C_IEN_MSTOP | I2C_IEN_RXDATAV | I2C_IEN_ERRORS;

    /* Start a transfer. */
    return I2C_Transfer(p_handle);
} /*lint !e952*/

#endif /* USE_I2C */
